---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeVertex.GetConstraints
source: html/cc9ad8f1-a696-0421-e641-f575ef564287.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeVertex.GetConstraints Method

Retrieve the list of constraints associated with this vertex.

## Syntax (C#)
```csharp
public IList<RebarShapeConstraint> GetConstraints()
```

## Returns
The list of constraints.